// Generated by jextract

package app.photofox.vipsffm.generated;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct _VipsInterpolateClass {
 *     VipsObjectClass parent_class;
 *     VipsInterpolateMethod interpolate;
 *     int (*get_window_size)(VipsInterpolate *);
 *     int window_size;
 *     int (*get_window_offset)(VipsInterpolate *);
 *     int window_offset;
 * }
 * }
 */
public class _VipsInterpolateClass {

    _VipsInterpolateClass() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        _VipsObjectClass.layout().withName("parent_class"),
        VipsRaw.C_POINTER.withName("interpolate"),
        VipsRaw.C_POINTER.withName("get_window_size"),
        VipsRaw.C_INT.withName("window_size"),
        MemoryLayout.paddingLayout(4),
        VipsRaw.C_POINTER.withName("get_window_offset"),
        VipsRaw.C_INT.withName("window_offset"),
        MemoryLayout.paddingLayout(4)
    ).withName("_VipsInterpolateClass");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final GroupLayout parent_class$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("parent_class"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VipsObjectClass parent_class
     * }
     */
    public static final GroupLayout parent_class$layout() {
        return parent_class$LAYOUT;
    }

    private static final long parent_class$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VipsObjectClass parent_class
     * }
     */
    public static final long parent_class$offset() {
        return parent_class$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VipsObjectClass parent_class
     * }
     */
    public static MemorySegment parent_class(MemorySegment struct) {
        return struct.asSlice(parent_class$OFFSET, parent_class$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VipsObjectClass parent_class
     * }
     */
    public static void parent_class(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, parent_class$OFFSET, parent_class$LAYOUT.byteSize());
    }

    private static final AddressLayout interpolate$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("interpolate"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VipsInterpolateMethod interpolate
     * }
     */
    public static final AddressLayout interpolate$layout() {
        return interpolate$LAYOUT;
    }

    private static final long interpolate$OFFSET = 328;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VipsInterpolateMethod interpolate
     * }
     */
    public static final long interpolate$offset() {
        return interpolate$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VipsInterpolateMethod interpolate
     * }
     */
    public static MemorySegment interpolate(MemorySegment struct) {
        return struct.get(interpolate$LAYOUT, interpolate$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VipsInterpolateMethod interpolate
     * }
     */
    public static void interpolate(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(interpolate$LAYOUT, interpolate$OFFSET, fieldValue);
    }

    /**
     * {@snippet lang=c :
     * int (*get_window_size)(VipsInterpolate *)
     * }
     */
    public static class get_window_size {

        get_window_size() {
            // Should not be called directly
        }

        /**
         * The function pointer signature, expressed as a functional interface
         */
        public interface Function {
            int apply(MemorySegment _x0);
        }

        private static final FunctionDescriptor $DESC = FunctionDescriptor.of(
            VipsRaw.C_INT,
            VipsRaw.C_POINTER
        );

        /**
         * The descriptor of this function pointer
         */
        public static FunctionDescriptor descriptor() {
            return $DESC;
        }

        private static final MethodHandle UP$MH = VipsRaw.upcallHandle(get_window_size.Function.class, "apply", $DESC);

        /**
         * Allocates a new upcall stub, whose implementation is defined by {@code fi}.
         * The lifetime of the returned segment is managed by {@code arena}
         */
        public static MemorySegment allocate(get_window_size.Function fi, Arena arena) {
            return Linker.nativeLinker().upcallStub(UP$MH.bindTo(fi), $DESC, arena);
        }

        private static final MethodHandle DOWN$MH = Linker.nativeLinker().downcallHandle($DESC);

        /**
         * Invoke the upcall stub {@code funcPtr}, with given parameters
         */
        public static int invoke(MemorySegment funcPtr,MemorySegment _x0) {
            try {
                return (int) DOWN$MH.invokeExact(funcPtr, _x0);
            } catch (Throwable ex$) {
                throw new AssertionError("should not reach here", ex$);
            }
        }
    }

    private static final AddressLayout get_window_size$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("get_window_size"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int (*get_window_size)(VipsInterpolate *)
     * }
     */
    public static final AddressLayout get_window_size$layout() {
        return get_window_size$LAYOUT;
    }

    private static final long get_window_size$OFFSET = 336;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int (*get_window_size)(VipsInterpolate *)
     * }
     */
    public static final long get_window_size$offset() {
        return get_window_size$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int (*get_window_size)(VipsInterpolate *)
     * }
     */
    public static MemorySegment get_window_size(MemorySegment struct) {
        return struct.get(get_window_size$LAYOUT, get_window_size$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int (*get_window_size)(VipsInterpolate *)
     * }
     */
    public static void get_window_size(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(get_window_size$LAYOUT, get_window_size$OFFSET, fieldValue);
    }

    private static final OfInt window_size$LAYOUT = (OfInt)$LAYOUT.select(groupElement("window_size"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int window_size
     * }
     */
    public static final OfInt window_size$layout() {
        return window_size$LAYOUT;
    }

    private static final long window_size$OFFSET = 344;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int window_size
     * }
     */
    public static final long window_size$offset() {
        return window_size$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int window_size
     * }
     */
    public static int window_size(MemorySegment struct) {
        return struct.get(window_size$LAYOUT, window_size$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int window_size
     * }
     */
    public static void window_size(MemorySegment struct, int fieldValue) {
        struct.set(window_size$LAYOUT, window_size$OFFSET, fieldValue);
    }

    /**
     * {@snippet lang=c :
     * int (*get_window_offset)(VipsInterpolate *)
     * }
     */
    public static class get_window_offset {

        get_window_offset() {
            // Should not be called directly
        }

        /**
         * The function pointer signature, expressed as a functional interface
         */
        public interface Function {
            int apply(MemorySegment _x0);
        }

        private static final FunctionDescriptor $DESC = FunctionDescriptor.of(
            VipsRaw.C_INT,
            VipsRaw.C_POINTER
        );

        /**
         * The descriptor of this function pointer
         */
        public static FunctionDescriptor descriptor() {
            return $DESC;
        }

        private static final MethodHandle UP$MH = VipsRaw.upcallHandle(get_window_offset.Function.class, "apply", $DESC);

        /**
         * Allocates a new upcall stub, whose implementation is defined by {@code fi}.
         * The lifetime of the returned segment is managed by {@code arena}
         */
        public static MemorySegment allocate(get_window_offset.Function fi, Arena arena) {
            return Linker.nativeLinker().upcallStub(UP$MH.bindTo(fi), $DESC, arena);
        }

        private static final MethodHandle DOWN$MH = Linker.nativeLinker().downcallHandle($DESC);

        /**
         * Invoke the upcall stub {@code funcPtr}, with given parameters
         */
        public static int invoke(MemorySegment funcPtr,MemorySegment _x0) {
            try {
                return (int) DOWN$MH.invokeExact(funcPtr, _x0);
            } catch (Throwable ex$) {
                throw new AssertionError("should not reach here", ex$);
            }
        }
    }

    private static final AddressLayout get_window_offset$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("get_window_offset"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int (*get_window_offset)(VipsInterpolate *)
     * }
     */
    public static final AddressLayout get_window_offset$layout() {
        return get_window_offset$LAYOUT;
    }

    private static final long get_window_offset$OFFSET = 352;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int (*get_window_offset)(VipsInterpolate *)
     * }
     */
    public static final long get_window_offset$offset() {
        return get_window_offset$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int (*get_window_offset)(VipsInterpolate *)
     * }
     */
    public static MemorySegment get_window_offset(MemorySegment struct) {
        return struct.get(get_window_offset$LAYOUT, get_window_offset$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int (*get_window_offset)(VipsInterpolate *)
     * }
     */
    public static void get_window_offset(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(get_window_offset$LAYOUT, get_window_offset$OFFSET, fieldValue);
    }

    private static final OfInt window_offset$LAYOUT = (OfInt)$LAYOUT.select(groupElement("window_offset"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int window_offset
     * }
     */
    public static final OfInt window_offset$layout() {
        return window_offset$LAYOUT;
    }

    private static final long window_offset$OFFSET = 360;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int window_offset
     * }
     */
    public static final long window_offset$offset() {
        return window_offset$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int window_offset
     * }
     */
    public static int window_offset(MemorySegment struct) {
        return struct.get(window_offset$LAYOUT, window_offset$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int window_offset
     * }
     */
    public static void window_offset(MemorySegment struct, int fieldValue) {
        struct.set(window_offset$LAYOUT, window_offset$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

