// Generated by jextract

package app.photofox.vipsffm.jextract;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct _GParamSpecString {
 *     GParamSpec parent_instance;
 *     gchar *default_value;
 *     gchar *cset_first;
 *     gchar *cset_nth;
 *     gchar substitutor;
 *     guint null_fold_if_empty : 1;
 *     guint ensure_non_null : 1;
 * }
 * }
 */
public class _GParamSpecString {

    _GParamSpecString() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        _GParamSpec.layout().withName("parent_instance"),
        VipsRaw.C_POINTER.withName("default_value"),
        VipsRaw.C_POINTER.withName("cset_first"),
        VipsRaw.C_POINTER.withName("cset_nth"),
        VipsRaw.C_CHAR.withName("substitutor"),
        MemoryLayout.paddingLayout(7)
    ).withName("_GParamSpecString");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final GroupLayout parent_instance$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("parent_instance"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * GParamSpec parent_instance
     * }
     */
    public static final GroupLayout parent_instance$layout() {
        return parent_instance$LAYOUT;
    }

    private static final long parent_instance$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * GParamSpec parent_instance
     * }
     */
    public static final long parent_instance$offset() {
        return parent_instance$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * GParamSpec parent_instance
     * }
     */
    public static MemorySegment parent_instance(MemorySegment struct) {
        return struct.asSlice(parent_instance$OFFSET, parent_instance$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * GParamSpec parent_instance
     * }
     */
    public static void parent_instance(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, parent_instance$OFFSET, parent_instance$LAYOUT.byteSize());
    }

    private static final AddressLayout default_value$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("default_value"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * gchar *default_value
     * }
     */
    public static final AddressLayout default_value$layout() {
        return default_value$LAYOUT;
    }

    private static final long default_value$OFFSET = 72;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * gchar *default_value
     * }
     */
    public static final long default_value$offset() {
        return default_value$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * gchar *default_value
     * }
     */
    public static MemorySegment default_value(MemorySegment struct) {
        return struct.get(default_value$LAYOUT, default_value$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * gchar *default_value
     * }
     */
    public static void default_value(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(default_value$LAYOUT, default_value$OFFSET, fieldValue);
    }

    private static final AddressLayout cset_first$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("cset_first"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * gchar *cset_first
     * }
     */
    public static final AddressLayout cset_first$layout() {
        return cset_first$LAYOUT;
    }

    private static final long cset_first$OFFSET = 80;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * gchar *cset_first
     * }
     */
    public static final long cset_first$offset() {
        return cset_first$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * gchar *cset_first
     * }
     */
    public static MemorySegment cset_first(MemorySegment struct) {
        return struct.get(cset_first$LAYOUT, cset_first$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * gchar *cset_first
     * }
     */
    public static void cset_first(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(cset_first$LAYOUT, cset_first$OFFSET, fieldValue);
    }

    private static final AddressLayout cset_nth$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("cset_nth"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * gchar *cset_nth
     * }
     */
    public static final AddressLayout cset_nth$layout() {
        return cset_nth$LAYOUT;
    }

    private static final long cset_nth$OFFSET = 88;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * gchar *cset_nth
     * }
     */
    public static final long cset_nth$offset() {
        return cset_nth$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * gchar *cset_nth
     * }
     */
    public static MemorySegment cset_nth(MemorySegment struct) {
        return struct.get(cset_nth$LAYOUT, cset_nth$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * gchar *cset_nth
     * }
     */
    public static void cset_nth(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(cset_nth$LAYOUT, cset_nth$OFFSET, fieldValue);
    }

    private static final OfByte substitutor$LAYOUT = (OfByte)$LAYOUT.select(groupElement("substitutor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * gchar substitutor
     * }
     */
    public static final OfByte substitutor$layout() {
        return substitutor$LAYOUT;
    }

    private static final long substitutor$OFFSET = 96;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * gchar substitutor
     * }
     */
    public static final long substitutor$offset() {
        return substitutor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * gchar substitutor
     * }
     */
    public static byte substitutor(MemorySegment struct) {
        return struct.get(substitutor$LAYOUT, substitutor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * gchar substitutor
     * }
     */
    public static void substitutor(MemorySegment struct, byte fieldValue) {
        struct.set(substitutor$LAYOUT, substitutor$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

